# SQL - Aggregation & Grouping
    What is Aggregation?
    Aggregation means summarizing multiple rows into meaningful values.
    Example questions aggregation helps answer:
    - What is the average salary?
    - How many employees are in each department?
    - What is the maximum sale per region?

    -> Aggregate Functions
        COUNT() - Number of rows
        SUM() -	Total value
        AVG() -	Average value
        MIN() -	Minimum value
        MAX() -	Maximum value

    GROUP BY 
    - Used to group rows that share a common value
    - Every column in SELECT must be aggregated or included in GROUP BY

### Database Connection

In [16]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

In [18]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('10.4.32-MariaDB',)]

### Using Already Created employees table in Database

In [21]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

## Basic Aggregation Examples

### Total number of employees

In [25]:
%%sql
select count(*) as Total_Employees
from employees;

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(7,)]

### Average salary of all employees

In [28]:
%%sql
select avg(salary) as Average_salary
from employees

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(Decimal('60000.0000'),)]

### Highest and lowest salary

In [37]:
%%sql
select max(salary) as Highest_salary, min(salary) as Lowest_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(85000, 40000)]

## GROUP BY Examples

### Number of employees in each department

In [46]:
%%sql
select department, count(*) as employee_count
from employees
group by department;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Finance', 2), ('HR', 2), ('IT', 3)]

### Average salary per department

In [51]:
%%sql
select department,avg(salary) as Average_salary_by_department
from employees
group by department;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Finance', Decimal('57500.0000')),
 ('HR', Decimal('42500.0000')),
 ('IT', Decimal('73333.3333'))]

### Total salary expense per city

In [60]:
%%sql
select city, sum(salary) as salary_espense_per_city
from employees
group by city;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[('Bangalore', Decimal('85000')),
 ('Delhi', Decimal('50000')),
 ('Mumbai', Decimal('85000')),
 ('Pune', Decimal('200000'))]

In [62]:
%%sql
select city, sum(salary) as salary_espense_per_city
from employees
group by city;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[('Bangalore', Decimal('85000')),
 ('Delhi', Decimal('50000')),
 ('Mumbai', Decimal('85000')),
 ('Pune', Decimal('200000'))]

## HAVING Clause

### Departments with average salary > 60,000

In [71]:
%%sql
select department, avg(salary) as Avg_salary_higher_than_60k
from employees
group by department 
having avg(salary)>60000;

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('IT', Decimal('73333.3333'))]

### Cities having more than 1 employee

In [80]:
%%sql
select city, count(*) as city_employee
from employees
group by city
having count(*) > 1;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[('Mumbai', 2), ('Pune', 3)]

## Data Analysis Questions

### Which department has the highest average salary?

In [87]:
%%sql
select department, avg(salary) as avg_salary
from employees
group by department 
order by avg_salary desc;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('IT', Decimal('73333.3333')),
 ('Finance', Decimal('57500.0000')),
 ('HR', Decimal('42500.0000'))]

### Average salary of employees older than 30

In [111]:
%%sql
select department, avg(salary) as Avg_salary
from employees
where age > 30
group by department;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[('Finance', Decimal('65000.0000')), ('HR', Decimal('40000.0000'))]

### Departments with total salary expense above 1,00,000

In [103]:
%%sql
select department, sum(salary) as Total_salary
from employees
group by department
having Total_salary > 100000;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[('Finance', Decimal('115000')), ('IT', Decimal('220000'))]